# Development tools
brew "git"
brew "stow"
brew "zsh"
brew "vim"
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "tree"
brew "htop"
brew "curl"
brew "wget"
brew "jq"
brew "yq"

# Programming languages and tools
brew "node"
brew "python@3.11"
brew "go"
brew "rust"

# Version control
brew "gh"
brew "git-delta"

# Terminal enhancements
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Applications
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "postman"
cask "firefox"
cask "google-chrome"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# macOS utilities
cask "rectangle"
cask "alfred"
cask "the-unarchiver"
