# Development tools - Core
brew "git"
brew "stow"
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "jq"
brew "fd"
brew "lf"

# Programming languages
brew "node"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "pyenv"
brew "go"
brew "jenv"
brew "openjdk"

# Version control & Git tools
brew "gh"
brew "git-delta"

# Terminal enhancements
brew "starship"

# Cloud & Infrastructure
brew "awscli"
brew "podman"

# Build & Development tools
brew "sbt"
brew "parallel"
brew "pipenv"

# Utilities
brew "htop"
brew "thefuck"
brew "autossh"
brew "ansiweather"
brew "astro"
brew "duckdb"
brew "pandoc"
brew "grep"
brew "findutils"

# Development environments - Java
cask "temurin"
cask "temurin@8"
cask "temurin@11"

# macOS utilities
cask "monitorcontrol"
cask "maccy"
cask "shortcat"

# Applications
cask "visual-studio-code"
cask "docker"
cask "postman"
cask "google-chrome"
cask "rectangle"
