# Taps (currently installed)
tap "adoptopenjdk/openjdk"
tap "codecrafters-io/tap"
tap "homebrew/cask-versions"
tap "isen-ng/dotnet-sdk-versions"

# Development tools
brew "git"                        # ✅ Installed
brew "stow"                       # ✅ Installed
# brew "zsh"                      # ❌ Not needed (system default)
# brew "vim"                      # ❌ Not installed
brew "neovim"                     # ✅ Installed
brew "tmux"                       # ✅ Installed
brew "fzf"                        # ✅ Installed
brew "ripgrep"                    # ✅ Installed
brew "bat"                        # ✅ Installed
brew "eza"                        # ✅ Installed
# brew "tree"                     # ❌ Not installed
# brew "htop"                     # ❌ Not installed
# brew "curl"                     # ❌ Not needed (system default)
# brew "wget"                     # ❌ Not installed
brew "jq"                         # ✅ Installed
# brew "yq"                       # ❌ Not installed

# Programming languages and tools
brew "node"                       # ✅ Installed
brew "python@3.11"               # ✅ Installed
brew "python@3.12"               # ✅ Installed (missing from original)
brew "python@3.13"               # ✅ Installed (missing from original)
# brew "go"                       # ❌ Not installed
# brew "rust"                     # ❌ Not installed

# Version control
brew "gh"                         # ✅ Installed
brew "git-delta"                  # ✅ Installed

# Terminal enhancements
brew "starship"                   # ✅ Installed
# brew "zsh-autosuggestions"      # ❌ Not installed (using zinit)
# brew "zsh-syntax-highlighting"  # ❌ Not installed (using zinit)

# File management
brew "fd"                         # ✅ Installed (missing from original)
brew "lf"                         # ✅ Installed (missing from original)

# Development tools (missing from original)
brew "awscli"                     # ✅ Installed
brew "codecrafters"               # ✅ Installed
brew "consul"                     # ✅ Installed
brew "consul-template"            # ✅ Installed
brew "nushell"                    # ✅ Installed
brew "openjdk"                    # ✅ Installed
brew "parallel"                   # ✅ Installed
brew "pipenv"                     # ✅ Installed
brew "podman"                     # ✅ Installed
brew "sbt"                        # ✅ Installed
brew "thefuck"                    # ✅ Installed
brew "vault"                      # ✅ Installed

# Utilities (missing from original)
brew "ansiweather"                # ✅ Installed
brew "astro"                      # ✅ Installed
brew "autossh"                    # ✅ Installed
brew "testdisk"                   # ✅ Installed

# Applications
# cask "visual-studio-code"       # ❌ Not installed
# cask "iterm2"                   # ❌ Not installed (using ghostty)
# cask "docker"                   # ❌ Not installed (using podman)
# cask "postman"                  # ❌ Not installed
# cask "firefox"                  # ❌ Not installed
# cask "google-chrome"            # ❌ Not installed

# Development environments (missing from original)
cask "dotnet-sdk8"                # ✅ Installed
cask "dotnet-sdk8-0-400"          # ✅ Installed
cask "temurin"                    # ✅ Installed
cask "temurin8"                   # ✅ Installed
cask "temurin11"                  # ✅ Installed
cask "temurin@8"                  # ✅ Installed
cask "temurin@11"                 # ✅ Installed

# Terminal applications (missing from original)
cask "ghostty"                    # ✅ Installed

# Fonts
# cask "font-fira-code-nerd-font"    # ❌ Not installed
# cask "font-jetbrains-mono-nerd-font" # ❌ Not installed

# macOS utilities
# cask "rectangle"                # ❌ Not installed
# cask "alfred"                   # ❌ Not installed
# cask "the-unarchiver"           # ❌ Not installed
cask "lunar"                      # ✅ Installed (missing from original)
cask "maccy"                      # ✅ Installed (missing from original)
cask "shortcat"                   # ✅ Installed (missing from original)
