alefragnani.project-manager
altimateai.vscode-altimate-mcp-server
amazonwebservices.codewhisperer-for-command-line-companion
asvetliakov.vscode-neovim
bibhasdn.unique-lines
braver.vscode-solarized
canadaduane.notes
catppuccin.catppuccin-vsc
coderallan.vscode-ebcdicconverter
cweijan.dbclient-jdbc
cweijan.vscode-postgresql-client2
eamodio.gitlens
fabiospampinato.vscode-open-in-github
foam.foam-vscode
ginfuru.ginfuru-better-solarized-dark-theme
github.copilot
github.copilot-chat
github.vscode-github-actions
grapecity.gc-excelviewer
innoverio.vscode-dbt-power-user
janisdd.vscode-edit-csv
johnpapa.vscode-peacock
joshmu.periscope
jpcrs.binocular
kennylong.kubernetes-yaml-formatter
l13rary.l13-projects
mads-hartmann.bash-ide-vscode
mechatroner.rainbow-csv
meezilla.json
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
onecrayon.theme-quietlight-vsc
phplasma.csv-to-table
rlivings39.fzf-quick-open
ryanolsonx.solarized
samuelcolvin.jinjahtml
scala-lang.scala
scalameta.metals
sirtori.indenticator
snowflake.snowflake-vsc
sumneko.lua
tamasfe.even-better-toml
tobias-z.vscode-harpoon
vsls-contrib.gistfs
vspacecode.whichkey
